//https://github.com/MrDiablec/technology-of-programming/lesson1
/*
Задание №2
Напишите программу, выводящую на экран слово «Hello» с помощью функции “Printf()”.
Задайте для нее нужную библиотеку.
В файле, отправляемом на проверку домашнего задания, комментарием укажите ссылку на репозиторий GitHub, где хранится ваша программа.
*/

#include <iostream>

int main(){
    printf("Hello");
    return 0;
}