//https://github.com/MrDiablec/technology-of-programming/tree/main/lesson-3-5
/*
Создать программу, которая с помощью цикла выводит слово «Hello» 9 раз.
*/

#include <stdio.h>

int main(){
    for (int i = 1; i <= 9; i++)
    {
        printf("Hello\n");
    }
}